app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'R') ORDER BY {"{:value=>\"title\"}"=>""} ASC
---
  def index
    @sort_by = params[:sort]
    @all_ratings = Movie.ratings
    @ratings = params[:ratings]
    redirect = false
    if @sort_by.nil? && !session[:sort].nil?
      @sort_by = session[:sort]
      redirect = true
    end
    if @ratings.nil? && !session[:ratings].nil?
      @ratings = session[:ratings]
      redirect = true
    end
    if redirect
      flash.keep
      redirect_to movies_path(:sort => @sort_by, :ratings => @ratings)
    end
    if @ratings.nil?
      @ratings = Hash.new
      @all_ratings.each {|rating| @ratings[rating] = 1}